using System;
using System.Collections.Generic;

namespace FamilyManagement.Services
{
    public class ServiceException : Exception
    {
        public int Code { get; private set; }
        public new string Message
        {
            get
            {
                return ServiceExceptionMessage[Code];
            }
        }

        private static readonly IDictionary<int, string> ServiceExceptionMessage = new Dictionary<int, string>()
        {
            //用户与机构
            {1001,"用户名或密码不正确！"},
            {1002,"用户被禁用！"},
            {1003,"密码重置成功！"},
            {1004,"密码修改成功！"},
            {1005,"两次输入的密码不匹配！"},
            {1006,"密码存在空格，不符合标准！"},
            {1007,"密码不足六位！"},
            {1008,"用户不存在！"},
            {1009,"登录名不存在！"},
            {1010,"当前登录机构不存在！"},
            {1011,"新增成功！"},
            {1012,"删除成功！"},
            {1013,"解冻成功！"},
            {1014,"冻结成功！"},
            {1015,"请输入用户名！"},
            {1016,"请输入密码！"},
            {1017,"入学测试编码不存在！"},
            {1018,"入学测试编码已被其他学生绑定！"},
            {1019,"当前登录机构不存在！"},
            {1020,"用户名已存在！"},
            {1021,"原密码不正确！"},
            {1022,"角色名已存在！"},
            {1023,"角色已被绑定，无法修改！"},
            {1024,"角色已被绑定，无法删除！"},
            {1025,"新密码与原密码相同！"},
            {1026,"该用户已绑定系统其他用户，无法编辑！"},
            {1027,"您输入的入学测试编码有重复！"},
            {1028,"学生已绑定测试、课程或作业，无法删除！"},
            {1029,"该用户已被绑定相关数据，无法删除！"},
            //{1027,"该用户已绑定为督导主管，无法修改角色！"},
            //{1028,"该用户已绑定为督导，无法修改角色！"},
            {1030,"学员关联的教师不能超过20人，请重新选择！"},
            {1031,"主管关联的下属员工不能超过50人，请重新选择！"},
            {1032,"绑定的角色不能超过5个，请重新选择！"},
            {1033,"角色应至少具有一项权限，请重新选择！"},
            {1034,"员工应至少绑定一个角色，请重新选择！"},
            {1035,"员工关联主管不能超过50人，请重新选择！"},
            {1036, "图片文件大小超过4M!"},
            {1037,"您已离校，无法继续使用。"},

            //Task
            //2.试题管理 Task
            { 2000, "试题不存在！" },
            { 2001, "修改人编号不存在！" },
            { 2002, "试题作答内容不存在！" },
            { 2003, "试题计分配置禁止修改！" },
            { 2004, "试题名称已存在！" },
            { 2005, "已有试卷使用试题！" },
            { 2006, "确认要删除试题，删除后无法恢复！" },
            { 2007, "Task已被绑定，无法修改！" },
            { 2008, "资料编号已存在！" },
            { 2009, "资料已被绑定，无法删除！" },
            { 2010, "共享资料，禁止删除！" },
            { 2011, "公用资料，禁止保存！" },
            { 2012, "分享资料，不能复制！" },
            { 2013, "资料已被其他人编辑，不能保存！" },
            { 2014, "公用的资料不能再次共享，请先复制资料！" },
            { 2015, "公用资料，禁止删除！" },

            //Task 批改
            { 2101, "请评分！" },
            { 2102, "确认放弃批改?" },

            //Task 雅思写作And雅思图文写作And SAT作文
            { 2103, "题目不能为空！" },
            { 2104, "范文不能为空！" },
            { 2105, "请在此区域写作..." },

            //Task 托福阅读
            { 2106, "编辑文章将清空所有题目在文章中的标记位置，是否继续？" },
            { 2107, "请在原文中选词后再点击按钮" },
            { 2108, "请在原文中选中后再点击按钮" },
            { 2109, "您已标记该位置" },
            { 2110, "请按顺序标记位置" },
            { 2111, "请至少保留一个题目" },
            { 2112, "请配置第 {0} 题标准答案" }, 
            { 2113, "音频文件不能为空" },
            { 2114, "播放次数必须为数字" },
            { 2115, "播放次数必须大于等于1" },
            { 2116, "题目不能为空" },
            { 2117, "阅读文章不能为空" },
            { 2118, "提交任务后将不能返回和修改答案，确认提交？" },
            { 2119, "确认删除该题？" },
            { 2120, "无法重复标志！" },
            { 2121, "是否清空该题所有标记?" },
            //word上传
            { 2122,"您的文件已损坏，请重新上传！"},
            { 2123,"请您上传正确格式的文件！"},
           
            //Task 托福口语与雅思口语 by 小潘
            { 2301, "请选择评分" },
            { 2302, "确认放弃批改？这将会导致编辑的数据内容丢失" },
            { 2303, "友情提醒" },
            { 2304, "说明不能为空" },
            { 2305, "说明音频不能为空" },
            { 2306, "题目不能为空" },
            { 2307, "题目音频不能为空" },
            { 2308, "参考答案不能为空" },
            { 2309, "标准回答不能为空" },
            { 2310, "阅读文本不能为空" },
            { 2311, "阅读音频不能为空" },
            { 2312, "听力音频不能为空" },
            { 2313, "图片不能为空" },
            { 2314, "问题不能为空" },
            { 2315, "问题音频不能为空" },
            { 2316, "录音上传中......" },
            { 2317, "作答时间已到，录音已停止" },
            { 2318, "请稍后或检查是否插入录音相关设备（话筒），并刷新重试" },
            { 2319, "请配置填空题答案" },
            //Task 托福听力5-6
            { 2400, "说明音频不能为空" },
            { 2401, "听力音频不能为空" },
            { 2402, "图片不能为空" },
            { 2403, "题目文本不能为空" },
            { 2404, "题目音频不能为空" },
            { 2405, "答案不能为空" },

            //Task 托福听力3-4
            { 2406, "阅读文本不能为空" },
            { 2407, "阅读音频不能为空" },

            //Task 托福独立写作
            { 2408, "思路点拨不能为空" },
            { 2409, "范文不能为空" },
            { 2410, "范文分数不能为空" },
              //Task 托福综合写作
            { 2411, "多次播放的次数不能小于2" },

            //Task 托福听力
            { 2500, "图片已删除" },
            { 2501, "未知错误" },
            { 2502, "请您上传mp3文件" },
            { 2503, "文件上传中" },
            { 2504, "选择文件" },
            { 2505, "上传图片类型不符，系统支持bmp、jpg、jpeg、png图片文件" },
            { 2506, "时间点已被占用,请选择其他时间点上传图片，或删除该时间点图片重新上传" },
            { 2507, "请配置第 {0} 题音频" },
            { 2508, "题目主音频不能为空" },

            // ;
            { 2611, "提醒" },
            { 2621, "该任务不能编辑" }, //参与组卷后不能修改
            { 2622, "请填写编号" }, 
            { 2623, "请填写名称" }, 
            { 2624, "请选择难度" }, 
            { 2625, "请正确填写限时" }, 
            { 2626, "保存成功！是否关闭页面？" },
            { 2627, "保存失败！请重新保存？" },
            { 2628, "确认放弃当前编辑页面？这将会导致编辑的数据内容丢失" },
            { 2629, "您确定要离开考试吗？" },
            { 2630, "未选中任何行" },
            { 2640, "是否删除？" },
            { 2641, "是否结束试做？点击[确认]将关闭当前页面" },
            { 2642, "请填写编号" }, 
			{ 2643, "为确保上传音频的质量，请设置不超过两分钟的答题限时！"},
            
             //Task SAT作文  by xp
            { 2701, "文摘不得为空" },
            { 2702, "Answer Sheet" },

            //V1.5 做题升级增加     
            //除了托福，其余所有『Submit』弹框使用通用文案：提交后将无法返回，确认提交？（原来文案统一改成该文案）
            { 2801, "提交后将无法返回，确认提交？"    },  
            /*
            全真雅思听力：音频播放中点击『Back』或『Next』提示
            托福听力：提示1&2
            托福综合写作：提示1&2&3&4&5&6
            雅思口语：题目音频播放中提示
            雅思听力：提示1
             */     
            { 2802, "离开页面后音频材料将无法再次播放，确认离开？"}, 
            //托福口语123：跳出提示
            { 2803, "离开页面后题目材料将无法再次被收听/查看，确认离开？"},
            //托福听力
            { 2804, "离开页面后, Lecture/Conversation将无法再次播放，确认离开？"}, 
            //视频学习
            { 2901, "请上传FLV文件！"}, 
            { 2902, "文件为空！"}, 
            { 2903, "上传出错！"}, 


            //通用题型配置相关文案 by xp 2014年11月10日 17:45:47
            { 2950,"无法同时开启分页与分步按钮！"},
            { 2951, "您已设置总限时，无法设置题组限时！"},
            { 2952, "您已设置题组限时，无法设置总限时！"},
            { 2953, "您的分步、分页、限时设置不符合要求，请调整后重试！"},
            { 2954, "请按照{00:00:00}格式进行输入,最大为12:59:59"},
            { 2955, "题组限时不能为0"},
            { 2956, "您的题组限时设置不符合要求，请重新设置。"},

            //共享资料
            {2980,"机构已使用共享内容，撤回共享失败。"},
            {2981,"{0}机构已使用，删除失败。"},
            //Paper与Exam
            {3001,"部分Task被修改，试卷无法创建"},
            {3002,"部分Task被修改，试卷无法修改"},
            {3003,"请输入不同的测试代码！"},
            {3004,"测试代码不正确，请重新输入"},
            {3005,"该授权码已经被其他人使用，请尝试使用其他授权码！"},
            {3006,"输入的授权码不正确，请重试！"},
            {3007,"获取授权码失败！"},
            {3008,"机构匹配不正确！"},
            {3009,"请输入4-8位的授权码！"},
            {3010,"授权码已被使用或被修改，请联系您的课程顾问！"},
            {3011, "测试已发布，无法删除！"},
            {3012, "测试没有绑定学员，不能发布！"},
            {3013, "该测试必须绑定教师！"},
            {3014, "测试发布代码必须填写！"},
            {3015, "该测试已发布，无法再次发布！"},
            {3016, "测试已发布，无法编辑！"},
            {3017,"测试名不能为空！"},
            //4.材料 Test
            { 4000, "试卷不存在！" },
            { 4001, "考试代码不存在！" },
            { 4002, "试卷未在使用中！" },
            { 4003, "试卷未生效！" },
            { 4004, "没有有效试题！" },
            { 4005, "用户没有进入此试题！" },
            { 4006, "用户有未完成的试题！" },
            { 4007, "试卷名不能为空！" },
            { 4008, "材料名已存在！" },
            { 4009, "试卷试题未配置完整！" },
            { 4010, "试卷已申请代码！" },
            { 4011, "无效的考试代码！" },
            { 4012, "试题不能为空！" },
            { 4013, "仍有待配置的得分项！" },
            { 4014, "存在【未限时】任务，无法开启完整全真组卷！" },
            { 4015, "是否放弃当前评分配置" },
            { 4016, "是否放弃当前组卷" },
            { 4017, "请勿使用多个用户同时进行测试！如有疑问，请联系客服。" },
            { 4018, "是否放弃当前评语配置" },
            { 4019, "评分配置保存成功！关闭页面？ " },
            { 4020, "姓名不能为空！" },
            { 4021, "班级不能为空！" },
            { 4022, "性别不能为空！" },
            { 4023, "考试代码不能为空！" },
            { 4024, "操作成功" },
            { 4025, "操作成功" },
            { 4026, "题库数量不足，智能出卷失败" },
            { 4027, "请按步骤组卷" },
            { 4028, "请填写正确的口语分数（0-4）" },
            { 4029, "托福组卷配分必须依次递减" },
            { 4030, "目标机构试题类型不存在，复制失败" },
            { 4031, "请至少选择一个位置" },
            { 4032, "该位置已布置试题是否替换" },
            { 4033, "没有需要配置得分对应表的题型，请直接点击【确认】完成试卷配置" },
            { 4034, "总比例超过100%！" },
            { 4035, "该试卷被使用过/正在使用中，无法编辑！" },
            { 4036, "确认删除试卷？" },
            { 4037, "跳过成功！点击【重置】恢复初始配置状态" },
            { 4038, "0分项无法跳过" },
            { 4039, "试卷已绑定测试，无法修改" },
            { 4040, "试卷中有任务被修改，请重新配置评分" },
            { 4041, "试卷已完成" },
            { 4042, "该试卷正在使用中，失效后测试将被终止，确认失效？" },
            { 4043, "该试卷下尚有未生成报告的数据，失效后该部分数据将丢失，确认失效？" },
            { 4044, "有{0}个未结束的code" },
            { 4045, "请完成评分区间配置"},
            { 4046, "试卷配置中不允许复制" },
            { 4047, "试卷未生效不允许分享" },
            { 4048, "该试卷正在使用中，失效后测试将被终止，并丢失尚未生成报告的数据，是否失效？" },
            { 4049, "该试卷正在配置中，无法生效" },
            { 4050, "该试卷已失效，无法继续当前操作，所有历史数据请到【存档】中查看" },
            { 4051, "请填写正确的分数（200-800的正整数）" },
            { 4052, "SAT作文评分应从上至下、从左往右依次递减" },
            { 4053, "SAT评分应从上至下依次递减" },
            { 4054, "请正确配置得分（必须存在最高分800及最低分200分数值）" },
            { 4055, "试卷中有重复的任务，请重新配置！"},
            { 4056, "当前页面有数据改动，将导致下一步数据清空。是否进入下一步？"},
            { 4057, "请勿重复提交测试！如有疑问，请联系客服。" },
            { 4058, "测试名已存在！" },
            { 4059, "测试时间无效" },
            { 4060, "测试进行中无法修改" },
          
            //试卷完成后，课程列表未刷新，提示用户页面出了点问题
            { 4061, "您的该次测试已经完成，如有问题请联系您的课程顾问(4061)。" },
            { 4062, "该测试不存在" },
            { 4063, "该材料不存在" },
            { 4064, "试卷已绑定测试，无法删除" },
            { 4065, "“配置中” 材料不可操作" },
            { 4066, "“已生效”材料被关联，不可操作" },
            { 4067, "进行中的测试不能删除！" },
            { 4068, "选择的试卷未生效" },
            { 4069, "请勿重复提交作业！如有疑问，请联系客服。" },
            { 4070, "授权用户有误！" },
            { 4071, "请输入授权权限的用户名和密码！" },
            { 4072, "共享材料,不能删除！" },
            { 4073, "共享材料,不能修改！" },
            { 4074, "共享材料,不能复制！" },
            { 4075, "测试不存在，无法查看" },
            { 4076, "材料已被其他人编辑，不能保存！" },
            { 4077, "共享材料,不能生效/失效！" },
            { 4078, "保存失败，如有问题请联系您的课程顾问(4078)！" },
            { 4079, "共享材料，不能删除！" },
            { 4080, "试卷代码不存在！" },
            { 4081, "请求出现错误！" },
            { 4082, "材料已被关联，不可切换至“配置中”" },
            { 4083, "公用材料，禁止删除！" },
            { 4084, "材料是公用状态或者包含了公用资料，禁止共享！" },
            { 4085, "材料是公用状态或者包含了公用资料，禁止共享！" },
            { 4086, "材料中有资料被删除！" },
            { 4087, "材料“配置中”，禁止复制！" },
            { 4088, "测试未开始！" },
            { 4089, "测试已截止！" },
            { 4090, "试卷名已存在"},
            { 4091, "请填写名称或编号！"},
            { 4092,"请填写试卷名！"},
            //5.模版管理
            { 5001, "模版名称不能为空" },
            { 5002, "模版内容不能为空" },
            { 5003, "模版名称已存在" },
            { 5004, "确认删除评分模板？" },
            { 5005, "无法获取指定模版" },
            { 5006, "评语模版保存成功！关闭页面？" },
            { 5007, "确定放弃当前模版？" },
            { 5008, "评语模版保存成功！关闭页面？" },
            { 5009, "评分模版保存成功！关闭页面？" },
            { 5010, "请填写评语内容！" },
            { 5011, "放弃配置当前模版？" },
            { 5012, "没有需要配置得分对应表的题型，请直接点击【确认】完成模版配置" },
            { 5013, "无匹配项，操作失败" },
            { 5014, "操作成功" },
            { 5015, "请至少勾选一种评语" },

            //6.作业
            { 6001, "作业名已存在！" },
            { 6002, "作业不存在！" },
            { 6003, "作业已绑定学生，无法编辑！" },
            { 6004, "作业已绑定学生，无法删除！" },
            { 6005, "作业不存在，无法查看" },
            { 6009, "作业未开始！" },
            { 6010, "作业已截止！" },
            {6011, "作业已发布，无法删除！"},
            {6012, "作业没有绑定学员，不能发布！"},
            {6013, "该作业必须绑定教师！"},
            {6014, "该作业已发布，无法再次发布！"},
            {6015, "作业已发布，无法编辑！"},
            {6016, "请填写作业名！"},
            {6017, "节点不存在！"},

            //7.课程
            { 7001, "课程名已存在！" },
            { 7002, "课程不存在！" },
            { 7003, "课程已绑定学生，无法编辑！" },
            { 7004, "课程已绑定学生，无法删除！" },
            { 7005, "课程未配置进度，无法绑定学生！" },
            { 7006, "课程不存在，无法查看" },
            { 7007, "课程已配置进度，无法编辑" },
            { 7008, "课程不存在，无法配置进度" },
            { 7009, "课程未开始！" },
            { 7010, "课程已截止！" },
            {7011, "课程已发布，无法删除！"},
            {7012, "课程没有绑定学员，不能发布！"},
            {7013, "该课程必须绑定教师！"},
            {7014, "该课程已发布，无法再次发布！"},
            {7015, "课程已发布，无法编辑！"},
            {7016,"请填写课程名！"},
            //8.后台管理
            { 8001, "用户名或密码不正确！" },

            //8.2 日程表管理
            { 8201, "教室被关联，不可删除！" },
            { 8202, "教室不存在！" },
            { 8203, "教室名已存在！" },
            { 8204, "关联学生超过教室上限，不能保存！" },
            { 8205, "关联教师超过教室上限，不能保存！" },
            { 8206, "当前日程存在冲突，请确认是否保存！"},
            { 8207, "当前日程存在冲突，请确认是否保存！"},
            { 8208, "当前日程存在冲突，请确认是否保存！"},
            { 8209, "教室不允许超过100个！"},
            { 8210, "请选择老师！"},
            {8211, "时段内有日程冲突，请解决冲突后再导出！"},
            {8212,"没有日程可复制，系统不复制全天和跨天日程！"},
            {8213,"时间段内日程为空！"},
            {8214,"开始时间不能晚于结束时间"},
            
            //类别管理
            { 8301, "分组不能超过3个！" },
            { 8302, "单个分组内的类别不能超过16个！" },

            //反馈表管理
            {8401 ,"问卷名称重复"},
            {8402 ,"已有反馈内容，禁止删除！"},
            {8403,"用户名或密码错误，身份验证失败！"},
            {8404,"用户名或密码错误，身份验证失败！"},
            {8405,"家长码输入错误，身份验证失败！"},
            {8406,"没有反馈表！"},
            {8407,"请关注微信服务号，重新进行身份验证！"},

            //班级、班型
            {8501,"班号已存在！！"},
            {8601,"班型名称已存在！！"},

            //9.系统管理
            { 9001, "同一时间段同一对象，只能有一条待发送的通知！" }, 
            { 9002, "日报数据异常！" }, 

            //多选操作下有部分失败
            {9999, "有{0}个选中项操作失败!"},

            //10.统一操作成功文案
            { 10000, "操作成功！" },
            { 10001, "非法操作！" },
        };

        public ServiceException(Exception ex, int msgCode, params string[] msg)
            : base(string.Format(ServiceExceptionMessage[msgCode], msg), ex)
        {
            this.Code = msgCode;
        }

        public ServiceException(int msgCode, params string[] msg)
            : base(string.Format(ServiceExceptionMessage[msgCode], msg))
        {
            this.Code = msgCode;
        }

        public ServiceException(int msgCode)
        {
            this.Code = msgCode;
        }

        public static IDictionary<int, string> GetError()
        {
            return ServiceExceptionMessage;
        }
    }
}
